----------------------------------------------------
--------------------- Task1 ------------------------
----------------------------------------------------
SELECT 
    t.ИД,
    v.ДАТА
FROM Н_ТИПЫ_ВЕДОМОСТЕЙ t
INNER JOIN Н_ВЕДОМОСТИ v 
    ON t.ИД = v.ТВ_ИД
WHERE  
    t.НАИМЕНОВАНИЕ = 'Перезачет'
    AND v.ДАТА::date = '2010-06-18';
--------
-- check 1 - without Filters
SELECT 
    t.ИД,
    v.ДАТА
FROM Н_ТИПЫ_ВЕДОМОСТЕЙ t
INNER JOIN Н_ВЕДОМОСТИ v 
    ON t.ИД = v.ТВ_ИД;
-- check 2 with data
SELECT 
    t.ИД,
    v.ДАТА
FROM Н_ТИПЫ_ВЕДОМОСТЕЙ t
INNER JOIN Н_ВЕДОМОСТИ v 
    ON t.ИД = v.ТВ_ИД
WHERE v.ДАТА::date = '2010-06-18';
-- check 3 with НАИМЕНОВАНИЕ
SELECT 
    t.ИД,
    v.ДАТА
FROM Н_ТИПЫ_ВЕДОМОСТЕЙ t
INNER JOIN Н_ВЕДОМОСТИ v 
    ON t.ИД = v.ТВ_ИД
WHERE  
    t.НАИМЕНОВАНИЕ = 'Перезачет';
-- resulte just with Перезачет i found after 2010-06-18
----------------------------------------------------
--------------------- Task2 ------------------------
----------------------------------------------------
SELECT
    p.ИД,
    e.ЧЛВК_ИД,
    s.ЧЛВК_ИД
FROM Н_УЧЕНИКИ s
JOIN Н_ОБУЧЕНИЯ e 
    ON e.ЧЛВК_ИД = s.ЧЛВК_ИД
JOIN Н_ЛЮДИ p 
    ON p.ИД = e.ЧЛВК_ИД
WHERE 
    p.ОТЧЕСТВО > 'Сергеевич'
    AND e.ЧЛВК_ИД > 105590
    AND s.ИД < 150308;
----------------------------------------------------
--------------------- Task3 ------------------------
----------------------------------------------------
-- ФКТИУ = факультет компьютерных технологий и управления
SELECT EXISTS (
    SELECT 1
    FROM Н_УЧЕНИКИ у
    JOIN Н_ЛЮДИ л
        ON л.ИД = у.ЧЛВК_ИД
    JOIN Н_ПЛАНЫ пл
        ON пл.ИД = у.ПЛАН_ИД
    JOIN Н_ОТДЕЛЫ отд
        ON отд.ИД = пл.ОТД_ИД
    WHERE 
        (отд.КОРОТКОЕ_ИМЯ ILIKE '%КТиУ%' 
        OR отд.ИМЯ_В_ИМИН_ПАДЕЖЕ ILIKE '%факультет компьютерных технологий и управления%')
        AND л.ДАТА_РОЖДЕНИЯ <= CURRENT_DATE - INTERVAL '25 years'
) AS есть_студенты_старше_25;

----------------------------------------------------
--------------------- Task4 ------------------------
----------------------------------------------------
-- 2011 
-- кафедра вычислительной техники => ВТ => id = 102 and ОТД_ИД = 703
-- SELECT => FROM => JOIN => WHERE => GROUP BY => HAVING => ORDER BY
SELECT 
    НУЧ.ГРУППА
FROM Н_УЧЕНИКИ НУЧ
JOIN Н_ПЛАНЫ НПЛ
    ON НПЛ.ИД = НУЧ.ПЛАН_ИД
JOIN Н_ОТДЕЛЫ НОТ
    ON НОТ.ИД = НПЛ.ОТД_ИД
WHERE 
    -- НОТ.КОРОТКОЕ_ИМЯ = 'ВТ'
	НОТ.ИМЯ_В_ИМИН_ПАДЕЖЕ = 'кафедра вычислительной техники',
	НПЛ.УЧЕБНЫЙ_ГОД LIKE '2011%'
GROUP BY 
    НУЧ.ГРУППА
HAVING 
    COUNT(НУЧ.ИД) >= 11;
----------------------------------------------------
--------------------- Task5 ------------------------
----------------------------------------------------
SELECT
    у.ГРУППА AS "Группа",
    ROUND(AVG(DATE_PART('year', AGE(л.ДАТА_РОЖДЕНИЯ)))::numeric, 2) AS "Средний возраст"
FROM Н_УЧЕНИКИ у
JOIN Н_ЛЮДИ л ON л.ИД = у.ЧЛВК_ИД
WHERE л.ДАТА_РОЖДЕНИЯ IS NOT NULL
GROUP BY у.ГРУППА
HAVING AVG(DATE_PART('year', AGE(л.ДАТА_РОЖДЕНИЯ))) >
        (
            SELECT MAX(DATE_PART('year', AGE(л2.ДАТА_РОЖДЕНИЯ)))
            FROM Н_УЧЕНИКИ у2
            JOIN Н_ЛЮДИ л2 ON л2.ИД = у2.ЧЛВК_ИД
            WHERE у2.ГРУППА = '1101'
                AND л2.ДАТА_РОЖДЕНИЯ IS NOT NULL
        )
ORDER BY "Средний возраст" DESC;

----------------------------------------------------
--------------------- Task6 ------------------------
----------------------------------------------------
SELECT
    у.ГРУППА                AS "Группа",
    о.НЗК                   AS "Номер студента",
    л.ФАМИЛИЯ               AS "Фамилия",
    л.ИМЯ                   AS "Имя",
    л.ОТЧЕСТВО              AS "Отчество",
    у.П_ПРКОК_ИД            AS "Номер пункта приказа",
    у.СОСТОЯНИЕ             AS "Состояние пункта приказа"
	-- фо.НАИМЕНОВАНИЕ 		AS "НАИМЕНОВАНИЕ",
	-- пл.КУРС AS "КУРС",
	-- у.НАЧАЛО AS "НАЧАЛО"
	
FROM Н_УЧЕНИКИ у
JOIN Н_ЛЮДИ л
    ON л.ИД = у.ЧЛВК_ИД
JOIN Н_ОБУЧЕНИЯ о
    ON о.ЧЛВК_ИД = у.ЧЛВК_ИД
    AND о.ВИД_ОБУЧ_ИД = у.ВИД_ОБУЧ_ИД
JOIN Н_ПЛАНЫ пл
    ON пл.ИД = у.ПЛАН_ИД
JOIN Н_ФОРМЫ_ОБУЧЕНИЯ фо
    ON фо.ИД = пл.ФО_ИД
WHERE у.НАЧАЛО > '2012-09-01'
    AND пл.КУРС = 1
    AND фо.НАИМЕНОВАНИЕ ILIKE 'Заочная'
ORDER BY у.ГРУППА, л.ФАМИЛИЯ;

----------------------------------------------------
--------------------- Task7 ------------------------
----------------------------------------------------
SELECT
    л.ИД,
    л.ФАМИЛИЯ,
    л.ИМЯ,
    л.ОТЧЕСТВО
FROM Н_ЛЮДИ л
WHERE NOT EXISTS (
    SELECT 1
    FROM Н_УЧЕНИКИ у
    WHERE у.ЧЛВК_ИД = л.ИД
)
ORDER BY л.ФАМИЛИЯ, л.ИМЯ;